# coding=utf-8

def valid(func):
    a1 = [  [0, 0, 0],
            [0, 0, 0],
            [0, 0, 0]]
    a2 = [  [1,1,1],
            [0,0 ,-1],
            [0,-1,0]]    
    a3 = [  [-1,-1,-1],
            [1,0,1],
            [0,0,0]]
    a4 = [  [-1,0, 1],
            [0, 0, 1],
            [-1,0, 1]]
    a5 = [  [1,0,-1],
            [0,0,-1],
            [0,0,-1]]
    a6 = [  [1,0,-1],
            [0,0, 0],
            [1,0,-1]]
    a7 = [  [1, -1, -1],
            [-1, 1, 1],
            [1, -1, -1] ]
    a8 = [  [1,  1,-1],
            [1, -1,-1],
            [-1, 1, 1]]
    a9 = [  [-1, 0, 1],
            [-1, 1, -1],
            [1,  0,  1]]
    a10 = [  [0,0, 0],
            [1,0, 0],
            [1,0, 0]]

    e_g = (a1,      a2,     a3,     a4,     a5,   a6,    a7,    a8,   a9,    a10)
    ans = ((False, None),  (True, 1),  (True, -1),   (True, 1),  (True, -1), (False, None),
           (True, 0), (True, -1), (True, 1),  (False, None))
    for i in range(10):
        message = str(e_g[i][0])+'\n'+str(e_g[i][1])+'\n'+str(e_g[i][2])+ '\nПолучено: '+str(func(e_g[i]))+'\nНужно:    '+ str(ans[i])
        assert func(e_g[i]) == ans[i], "\nФункция не прошла сценарий a" + str(i+1) + ':\n' + message

    return "Тест пройден"

